---
kind: property
id: P:Autodesk.Revit.DB.Transform.Determinant
zh: 变换
source: html/4bf53ffc-c955-ad6c-a446-263cbb9e8b28.htm
---
# Autodesk.Revit.DB.Transform.Determinant Property

**中文**: 变换

The determinant of this transformation.

## Syntax (C#)
```csharp
public double Determinant { get; }
```

## Remarks
The geometric meaning of a determinant is as the scale factor for volume
when applied as linear transformation.